In [15]:
data = {
   "success":True,
   "code":"SUCCESS",
   "data":{
      "hoverData":{
         "north and middle andaman district":{
            "registeredUsers":632,
            "appOpens":0
         },
         "south andaman district":{
            "registeredUsers":5846,
            "appOpens":0
         },
         "nicobars district":{
            "registeredUsers":262,
            "appOpens":0
         }
      }
   },
   "responseTimestamp":1630502911500
}

In [6]:
districts = list(data['data']['hoverData'].keys())
districts

['north and middle andaman district',
 'south andaman district',
 'nicobars district']

In [13]:

for i in data['data']['hoverData']:
    dis_name = i
    count = data['data']['hoverData'][i]['registeredUsers']
    print(dis_name, count)

north and middle andaman district 632
south andaman district 5846
nicobars district 262

In [16]:
data = {'success': True, 'code': 'SUCCESS', 'data': {'hoverData': {'puducherry': {'registeredUsers': 49318, 'appOpens': 0}, 'tamil nadu': {'registeredUsers': 2104754, 'appOpens': 0}, 'uttar pradesh': {'registeredUsers': 4694250, 'appOpens': 0}, 'madhya pradesh': {'registeredUsers': 2553603, 'appOpens': 0}, 'andhra pradesh': {'registeredUsers': 3336450, 'appOpens': 0}, 'tripura': {'registeredUsers': 55157, 'appOpens': 0}, 'lakshadweep': {'registeredUsers': 501, 'appOpens': 0}, 'manipur': {'registeredUsers': 29925, 'appOpens': 0}, 'maharashtra': {'registeredUsers': 6106994, 'appOpens': 0}, 'dadra & nagar haveli & daman & diu': {'registeredUsers': 53258, 'appOpens': 0}, 'meghalaya': {'registeredUsers': 18513, 'appOpens': 0}, 'andaman & nicobar islands': {'registeredUsers': 6740, 'appOpens': 0}, 'haryana': {'registeredUsers': 1847357, 'appOpens': 0}, 'rajasthan': {'registeredUsers': 3158202, 'appOpens': 0}, 'ladakh': {'registeredUsers': 8784, 'appOpens': 0}, 'punjab': {'registeredUsers': 847142, 'appOpens': 0}, 'assam': {'registeredUsers': 385237, 'appOpens': 0}, 'jharkhand': {'registeredUsers': 885762, 'appOpens': 0}, 'odisha': {'registeredUsers': 1594015, 'appOpens': 0}, 'bihar': {'registeredUsers': 2133804, 'appOpens': 0}, 'kerala': {'registeredUsers': 784184, 'appOpens': 0}, 'karnataka': {'registeredUsers': 3717763, 'appOpens': 0}, 'chandigarh': {'registeredUsers': 86268, 'appOpens': 0}, 'telangana': {'registeredUsers': 3315560, 'appOpens': 0}, 'himachal pradesh': {'registeredUsers': 227373, 'appOpens': 0}, 'west bengal': {'registeredUsers': 2604789, 'appOpens': 0}, 'gujarat': {'registeredUsers': 2690048, 'appOpens': 0}, 'sikkim': {'registeredUsers': 20051, 'appOpens': 0}, 'nagaland': {'registeredUsers': 15074, 'appOpens': 0}, 'mizoram': {'registeredUsers': 7593, 'appOpens': 0}, 'chhattisgarh': {'registeredUsers': 679263, 'appOpens': 0}, 'jammu & kashmir': {'registeredUsers': 176425, 'appOpens': 0}, 'goa': {'registeredUsers': 91936, 'appOpens': 0}, 'arunachal pradesh': {'registeredUsers': 21495, 'appOpens': 0}, 'delhi': {'registeredUsers': 2087022, 'appOpens': 0}, 'uttarakhand': {'registeredUsers': 483043, 'appOpens': 0}}}, 'responseTimestamp': 1630502909437}

In [17]:
for i in data['data']['hoverData']:
    dis_name = i
    count = data['data']['hoverData'][i]['registeredUsers']
    print(dis_name, count)

puducherry 49318
tamil nadu 2104754
uttar pradesh 4694250
madhya pradesh 2553603
andhra pradesh 3336450
tripura 55157
lakshadweep 501
manipur 29925
maharashtra 6106994
dadra & nagar haveli & daman & diu 53258
meghalaya 18513
andaman & nicobar islands 6740
haryana 1847357
rajasthan 3158202
ladakh 8784
punjab 847142
assam 385237
jharkhand 885762
odisha 1594015
bihar 2133804
kerala 784184
karnataka 3717763
chandigarh 86268
telangana 3315560
himachal pradesh 227373
west bengal 2604789
gujarat 2690048
sikkim 20051
nagaland 15074
mizoram 7593
chhattisgarh 679263
jammu & kashmir 176425
goa 91936
arunachal pradesh 21495
delhi 2087022
uttarakhand 483043

In [2]:
Data = {'success': True, 'code': 'SUCCESS', 'data': {'states': None, 'districts': [{'entityName': 'south andaman', 'metric': {'type': 'TOTAL', 'count': 5688, 'amount': 12560249.343665812}}, {'entityName': 'nicobars', 'metric': {'type': 'TOTAL', 'count': 528, 'amount': 1139848.801225994}}, {'entityName': 'north and middle andaman', 'metric': {'type': 'TOTAL', 'count': 442, 'amount': 931663.0770939873}}], 'pincodes': [{'entityName': '744101', 'metric': {'type': 'TOTAL', 'count': 1622, 'amount': 2769297.9039997994}}, {'entityName': '744103', 'metric': {'type': 'TOTAL', 'count': 1223, 'amount': 2238041.8716124697}}, {'entityName': '744102', 'metric': {'type': 'TOTAL', 'count': 969, 'amount': 3519059.937562449}}, {'entityName': '744105', 'metric': {'type': 'TOTAL', 'count': 685, 'amount': 1298560.9515503529}}, {'entityName': '744104', 'metric': {'type': 'TOTAL', 'count': 340, 'amount': 1039715.3111450541}}, {'entityName': '744107', 'metric': {'type': 'TOTAL', 'count': 302, 'amount': 556059.5308556345}}, {'entityName': '744301', 'metric': {'type': 'TOTAL', 'count': 283, 'amount': 445739.1633851439}}, {'entityName': '744112', 'metric': {'type': 'TOTAL', 'count': 269, 'amount': 333709.56700413954}}, {'entityName': '744202', 'metric': {'type': 'TOTAL', 'count': 193, 'amount': 238914.01667155625}}, {'entityName': '744302', 'metric': {'type': 'TOTAL', 'count': 168, 'amount': 547469.6509380838}}]}, 'responseTimestamp': 1630501486876}

In [18]:
clm={'State':[], 'Year':[],'Quater':[],"District Name":[], 'Pincode':[],'Transaction_count':[], 'Transaction_amount':[]}
for each in Data['data']:
    if each == 'states':
        continue
    if each == 'districts':
        print()
        for i in range(len(Data['data'][each])):
            name = Data['data'][each][i]['entityName']
            count = Data['data'][each][i]['metric']['count']
            amount = Data['data'][each][i]['metric']['amount']
            print(name, count, amount)
    if each == 'pincodes':
        for i in range(len(Data['data'][each])):
            pincode = Data['data'][each][i]['entityName']
            count = Data['data'][each][i]['metric']['count']
            amount = Data['data'][each][i]['metric']['amount']
            print(pincode, count, amount)

south andaman 5688 12560249.343665812
nicobars 528 1139848.801225994
north and middle andaman 442 931663.0770939873
744101 1622 2769297.9039997994
744103 1223 2238041.8716124697
744102 969 3519059.937562449
744105 685 1298560.9515503529
744104 340 1039715.3111450541
744107 302 556059.5308556345
744301 283 445739.1633851439
744112 269 333709.56700413954
744202 193 238914.01667155625
744302 168 547469.6509380838

In [2]:
l = [1,2,3,4,5]
l.index(1)

0

In [4]:
a,b,x = map(int, input().split(' '))
print(a)

3 5 2
3

In [13]:
import sqlite3 as sql
import sqlalchemy as sqa
import pandas as pd
import seaborn as sns

In [2]:

connection = sql.connect('phnoephe.db')
cr = connection.cursor()
query = """CREATE TABLE Agg_Trans_India(State TEXT, Year BIGINT)"""
cr.execute(query)
connection.commit()

OperationalError: table Agg_Trans_India already exists

In [4]:
query = """DROP TABLE Agg_Trans_India"""
cr.execute(query)
connection.commit()

In [3]:
engine = sqa.create_engine('sqlite:///phnoephe.db')

## checking the join without primary and foreign keys

In [14]:
ATI_df = pd.read_csv(r'D:\Phone pluse project\extracted_csv_files\AGG\Agg_tns_India_df.csv')
ATI_df.drop('Unnamed: 0',axis=1, inplace=True)
ATI_df

,Year,Quater,Transaction_type,Transaction_count,Transaction_amount
0,2018,1,Recharge & bill payments,72550406,1.447271e+10
1,2018,1,Peer-to-peer payments,46982705,1.472459e+11
2,2018,1,Merchant payments,5368669,4.656679e+09
3,2018,1,Financial Services,3762820,8.158531e+08
4,2018,1,Others,5761576,4.643217e+09
...,...,...,...,...,...
95,2022,4,Merchant payments,6565690145,3.673601e+12
96,2022,4,Peer-to-peer payments,4459859921,1.457887e+13
97,2022,4,Recharge & bill payments,991049281,6.497768e+11
98,2022,4,Financial Services,4623387,5.360528e+09
99,2022,4,Others,10013085,7.361493e+09

In [15]:
ATI_df['Transaction_amount'].loc[1]

147245883542.77402

In [1]:
round(0.25552,2)

0.26

In [10]:
ATI_df['Transaction_amount'] = ATI_df['Transaction_amount'].apply(lambda x: int(x))
ATI_df

,Year,Quater,Transaction_type,Transaction_count,Transaction_amount
0,2018,1,Recharge & bill payments,72550406,14472713558
1,2018,1,Peer-to-peer payments,46982705,147245883542
2,2018,1,Merchant payments,5368669,4656678915
3,2018,1,Financial Services,3762820,815853105
4,2018,1,Others,5761576,4643217301
...,...,...,...,...,...
95,2022,4,Merchant payments,6565690145,3673601044800
96,2022,4,Peer-to-peer payments,4459859921,14578874324207
97,2022,4,Recharge & bill payments,991049281,649776847580
98,2022,4,Financial Services,4623387,5360528394
99,2022,4,Others,10013085,7361492606

In [12]:
ATI_df.to_sql('Agg_Trans_India', engine, if_exists='append', index=False)

100

In [13]:
ATI_df = pd.read_sql('Agg_Trans_India', con=engine.connect())
ATI_df

,Year,Quater,Transaction_type,Transaction_count,Transaction_amount
0,2018,1,Recharge & bill payments,72550406,1.447271e+10
1,2018,1,Peer-to-peer payments,46982705,1.472459e+11
2,2018,1,Merchant payments,5368669,4.656679e+09
3,2018,1,Financial Services,3762820,8.158531e+08
4,2018,1,Others,5761576,4.643217e+09
...,...,...,...,...,...
95,2022,4,Merchant payments,6565690145,3.673601e+12
96,2022,4,Peer-to-peer payments,4459859921,1.457887e+13
97,2022,4,Recharge & bill payments,991049281,6.497768e+11
98,2022,4,Financial Services,4623387,5.360528e+09
99,2022,4,Others,10013085,7.361493e+09

In [6]:
AUI_df = pd.read_csv(r'D:\Phone pluse project\extracted_csv_files\AGG\Agg_user_India_df.csv')
AUI_df.drop('Unnamed: 0',axis=1, inplace=True)
AUI_df

     Year  Quater User_Brand  No_of_Users   Percent
0    2018       1     Xiaomi     11926334  0.254413
1    2018       1    Samsung      9609401  0.204988
2    2018       1       Vivo      5894293  0.125737
3    2018       1       Oppo      4479351  0.095554
4    2018       1     Realme      2376866  0.050703
..    ...     ...        ...          ...       ...
182  2022       1    OnePlus      7974546  0.021382
183  2022       1   Motorola      5610140  0.015043
184  2022       1     Huawei      4882972  0.013093
185  2022       1      Tecno      4550078  0.012200
186  2022       1     Others     25835848  0.069274

[187 rows x 5 columns]

In [7]:
AUI_df.info(0)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 187 entries, 0 to 186
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Year         187 non-null    int64
 1   Quater       187 non-null    int64
 2   User_Brand   187 non-null    object
 3   No_of_Users  187 non-null    int64
 4   Percent      187 non-null    float64
dtypes: float64(1), int64(3), object(1)
memory usage: 7.4+ KB

In [15]:
AUI_df.to_sql('Agg_User_India', engine, if_exists='append', index=False)

187

In [16]:
AUI_df = pd.read_sql('Agg_User_India', con=engine.connect())
AUI_df

     Year  Quater User_Brand  No_of_Users   Percent
0    2018       1     Xiaomi     11926334  0.254413
1    2018       1    Samsung      9609401  0.204988
2    2018       1       Vivo      5894293  0.125737
3    2018       1       Oppo      4479351  0.095554
4    2018       1     Realme      2376866  0.050703
..    ...     ...        ...          ...       ...
182  2022       1    OnePlus      7974546  0.021382
183  2022       1   Motorola      5610140  0.015043
184  2022       1     Huawei      4882972  0.013093
185  2022       1      Tecno      4550078  0.012200
186  2022       1     Others     25835848  0.069274

[187 rows x 5 columns]

In [19]:
from sqlalchemy import text

In [20]:
query = text("""SELECT Agg_Trans_India.Year, Agg_Trans_India.Quater, Transaction_amount, No_of_Users FROM Agg_Trans_India JOIN Agg_User_India ON Agg_Trans_India.Year = Agg_User_India.Year;""")

df = pd.read_sql(query, con=engine.connect())
df

      Year  Quater  Transaction_amount  No_of_Users
0     2018       1        1.447271e+10       808774
1     2018       1        1.447271e+10      1104740
2     2018       1        1.447271e+10      1246507
3     2018       1        1.447271e+10      1444125
4     2018       1        1.447271e+10      1536418
...    ...     ...                 ...          ...
3735  2022       4        7.361493e+09     32685615
3736  2022       4        7.361493e+09     49093857
3737  2022       4        7.361493e+09     65886728
3738  2022       4        7.361493e+09     77224616
3739  2022       4        7.361493e+09     88426997

[3740 rows x 4 columns]

In [11]:
number_string = 14472713558
number_commas_only = "{:,}".format(number_string)
print(number_commas_only)

14,472,713,558

In [6]:
import decimal
def currencyInIndiaFormat(n):
  d = decimal.Decimal(str(n))
  if d.as_tuple().exponent < -2:
    s = str(n)
  else:
    s = '{0:.2f}'.format(n)
  l = len(s)
  i = l-1;
  res = ''
  flag = 0
  k = 0
  while i>=0:
    if flag==0:
      res = res + s[i]
      if s[i]=='.':
        flag = 1
    elif flag==1:
      k = k + 1
      res = res + s[i]
      if k==3 and i-1>=0:
        res = res + ','
        flag = 2
        k = 0
    else:
      k = k + 1
      res = res + s[i]
      if k==2 and i-1>=0:
        res = res + ','
        flag = 2
        k = 0
    i = i - 1

  return res[::-1]


n = 14472713558
print( "INR " + currencyInIndiaFormat(n) ) # INR 100.52
n = 1000.108
print( "INR " + currencyInIndiaFormat(n))  # INR 1,000.108
n = 1200000
print ("INR " + currencyInIndiaFormat(n) ) # INR 12,00,000.00

INR 14,47,27,13,558.00
INR 1,000.108
INR 12,00,000.00

In [15]:
import locale
locale.setlocale(locale.LC_MONETARY, 'en_IN')
x = locale.currency(14472713558, grouping=True)
x,a,b = x.partition('.')
print(x)

₹ 14,47,27,13,558

In [11]:
def formatINR(number):
    s, *d = str(number).partition(".") 
    r = ",".join([s[x-2:x] for x in range(-3, -len(s), -2)][::-1] + [s[-3:]])
    return "".join([r] + d)

print(formatINR(147245883542))

1,47,24,58,83,542

In [17]:
def format_cash(amount):
    def truncate_float(number, places):
        return int(number * (10 ** places)) / 10 ** places

    if amount < 1e3:
        return amount

    if 1e3 <= amount < 1e5:
        return str(truncate_float((amount / 1e5) * 100, 2)) + " K"

    if 1e5 <= amount < 1e7:
        return str(truncate_float((amount / 1e7) * 100, 2)) + " L"

    if amount > 1e7:
        return str(truncate_float(amount / 1e7, 2)) + " Cr"

In [23]:
x= format_cash(147245883542)
x

'14724.58 Cr'

In [27]:
def formatINR(number):
    s, *d, c = str(number).partition(".") 
    r = ",".join([s[x-2:x] for x in range(-3, -len(s), -2)][::-1] + [s[-3:]])
    return "".join([r] + d)

In [28]:
n,d,v = x.partition('.')
print(n,d,v)
print(int(n))

final = formatINR(int(n))
print(final+d+v)

14724 . 58 Cr
14724
14,724.58 Cr

In [29]:
def final_format(amount):
    x = format_cash(amount)
    n,d,v = x.partition('.')
    value = formatINR(int(n))
    final = value + d + v
    return final

In [30]:
final_format(147245883542)

'14,724.58 Cr'

In [11]:
# s = 147245883542
s,d,c = str(147245883542).partition(".")
print(s)

147245883542

In [13]:
r = ''
for x in range(-3, -len(s), -2):
    
    print(s[x-2:x][::-1])
    r = r + s[x-2:x][::-1]
    
print(r)
#     print([s[-3:]])
#     ','.join(s[x-2:x][::-1]+[s[-3:]])

38
85
42
74
1
388542741

In [2]:
import sqlalchemy as sqa
from sqlalchemy import text
import pandas as pd

In [4]:
engine = sqa.create_engine("sqlite:///phonepluse.db")

In [5]:
query = text("""SELECT sum(Transaction_count) FROM Agg_tns_India;""")
all_trans = pd.read_sql(query, con=engine.connect())
all_trans

   sum(Transaction_count)
0             71723952547

In [12]:
all_trans.iloc[0]['sum(Transaction_count)']

71723952547

# example of a choropeth map

In [ ]:
# ! pip install geopandas

In [14]:
import geopandas as gpd
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [23]:
gdf = gpd.read_file(r"D:\Phone pluse project\IND_adm\IND_adm1.csv")
gdf.head(10)

,OBJECTID,ID_0,ISO,NAME_0,ID_1,NAME_1,TYPE_1,ENGTYPE_1,NL_NAME_1,VARNAME_1,geometry
0,1,105,IND,India,1,Andaman and Nicobar,Union Territor,Union Territory,NA,Andaman & Nicobar Islands|Andaman et Nicobar|I...,None
1,2,105,IND,India,2,Andhra Pradesh,State,State,NA,NA,None
2,3,105,IND,India,3,Arunachal Pradesh,State,State,NA,Agence de la FrontiÃ¨re du Nord-Est(French-obs...,None
3,4,105,IND,India,4,Assam,State,State,NA,NA,None
4,5,105,IND,India,5,Bihar,State,State,NA,NA,None
5,6,105,IND,India,6,Chandigarh,Union Territor,Union Territory,NA,NA,None
6,7,105,IND,India,7,Chhattisgarh,State,State,NA,NA,None
7,8,105,IND,India,8,Dadra and Nagar Haveli,Union Territor,Union Territory,NA,DAdra et Nagar Haveli|Dadra e Nagar Haveli,None
8,9,105,IND,India,9,Daman and Diu,Union Territor,Union Territory,NA,NA,None
9,10,105,IND,India,10,Delhi,Union Territor,Union Territory,NA,NA,None